#1) Дано масив чисел, знайти суму всіх додатніх чисел  масиву не використовуючи цикли:
arr = [4, 0, -5, -1, 7, -1, 3]
sum = 0

arr.each{ |i| sum += i if i>0 }
puts sum



#2) Задано масив, створити новий масив із даних цього масиву які є рядком.
undefined = 222
arr = ["apple", true, "kiwi", 4, 88, "33", false, undefined, "JS"]
newArr = []

arr.each { |i| newArr << i if i == i.to_s }
p newArr



#3) Задано масив чисел, знайти число яке найбільш часто входить в масив, занести це число в новий масив і видалити всі входження цього числа із поточного масиву.
arr = [4, 5, 2, 1, 6, 5, 3, 5, 2, 5]
x = Hash.new(0)

arr.each { |i| x[i] += 1 }
moda = x.max_by { |k, v| v }[0]

new_arr = arr.select{ |i| i != moda }
p moda
p new_arr